{
  "format": "chronological",
  "contact": {
    "name": "Colton Batts",
    "location": "Fort Worth, TX",
    "phone": "646-373-6126",
    "email": "colton.batts@gmail.com",
    "website": "coltonbatts.com"
  },
  "summary": "Production-focused multimedia designer with 10+ years delivering high-volume, broadcast-quality content for global brands including Google, Under Armour, and Kate Spade. Expert in Adobe Premiere Pro and After Effects with strong Photoshop-driven design support and file hygiene. Known for fast turnarounds, clean stakeholder review cycles, and shipping polished deliverables across video, motion, and print. Currently seeking full-time opportunities to bring agency-level production expertise to an in-house team or studio environment.",
  "experience": [
    {
      "title": "Lead Video Editor",
      "company": "Capture This (Creative Agency)",
      "location": "New York, NY (Remote)",
      "dates": "2021 – Present",
      "bullets": [
        "Ongoing contract relationship serving as lead editor for high-profile national campaigns and commercial clients",
        "Shop With Google: Edited 30+ unique video assets for national 'Back to School' and evergreen campaigns; managed high-volume deliverables across multiple aspect ratios",
        "Under Armour: Edited the 'New Rollout' internal training series (5+ comprehensive deliverables); praised for narrative clarity and brand guideline adherence",
        "Kate Spade: Created stylized intro sequences and social media assets, using motion graphics to match the brand's high-fashion aesthetic",
        "Nuuly: Provided integrated production support, designing key props and graphic assets utilized in final video campaigns",
        "Managed remote proxy workflows and rapid revision cycles, consistently turning around rough cuts within 24 hours"
      ]
    },
    {
      "title": "Multimedia Designer & Video Lead",
      "company": "Freedom Powersports",
      "location": "Fort Worth, TX",
      "dates": "2015 – 2021",
      "bullets": [
        "Led print-ready design production for retail and events: large-format signage, building wraps, flags, and promotional display systems across multiple OEM brands",
        "Produced vendor-ready files to spec (bleed/trim, scale, export settings), coordinated proofing, and managed revisions through final install",
        "Owned the internal video production pipeline for 6 years, serving as primary editor for corporate communications, training, and promotional media"
      ]
    }
  ],
  "skills": [
    {
      "category": "Core NLE",
      "items": ["Adobe Premiere Pro (Expert)", "DaVinci Resolve"]
    },
    {
      "category": "Motion & Design",
      "items": ["Adobe After Effects", "Photoshop", "Illustrator"]
    },
    {
      "category": "Print + Production Design",
      "items": ["Large-format print (wraps, signage)", "Event collateral systems", "Vendor proofing", "Print-ready file setup"]
    },
    {
      "category": "Post-Production",
      "items": ["Proxy workflows", "Multi-cam editing", "Color correction", "Sound design/mixing"]
    },
    {
      "category": "Workflow Optimization",
      "items": ["AI-assisted asset generation", "Storyboarding", "Fast pre-production cycles"]
    }
  ],
  "education": []
}
